<?php

namespace App\Http\Controllers;
use Inertia\Inertia; //ใส้Inertia
use Illuminate\Http\Request;
//สร้าง php artisan make:controller ProductController -rm
class ProductController extends Controller
{
    private $products = [
        ['id' => 1, 'name' => 'ส้มตำ', 'description' => 'เมนูที่ทุกคนทั่วโลกรู้จักจานนี้มาในหลากหลายรูปแบบ ลูกอีสานบางคนยืนยันว่าส้มตำจะขาดปลาร้าไม่ได้ แต่หัวใจของจานนี้อยู่ที่เส้นมะละกอดิบที่ต้องสดกรอบ ก่อนนำมาตำกับมะเขือเทศ พริก และกระเทียม ตำปลาร้าฉบับอีสานแท้ ๆ โดดเด่นด้วยกลิ่นแรงจากปลาร้า รสนัวจากมะกอก และความกรอบจากเม็ดกระถิน ถ้าใจยังไม่ถึงพออาจลองตำไทยที่คนภาคกลางนำมาปรับให้กินได้ง่ายขึ้นก่อนได้ รสชาติออกเปรี้ยวหวานจากน้ำตาลปี๊บและน้ำมะนาว ผสานรสเค็มจากน้ำปลาและกุ้งแห้ง ความกรอบก็ยังมีอยู่ แต่ใช้ถั่วลิสงแทนเม็ดกระถิน นอกจากตำปลาร้าและตำไทยแล้ว ยังมีตำซั่ว (ส้มตำผสมเส้นขนมจีน) ตำข้าวโพด ตำแตง ตำผลไม้ และอื่น ๆ ตามแต่ร้านจะสร้างสรรค์ ทุกแบบเพิ่มความอร่อยได้ด้วยการจกคู่ข้าวเหนียวหรือขนมจีน', 'price' => 60, 'image' => '/Images/Somtam.jpg'],
        ['id' => 2, 'name' => 'แกงอ่อม', 'description' => 'แกงกะหรี่แดนอีสาน ทำจากน้ำพริกโขลกสด ๆ แคลอรี่น้อยเพราะไร้กะทิ ความอร่อยอยู่ที่ผักสดตามฤดูกาลที่นำมาทำ ใส่เนื้อได้หลากหลายทั้งไก่ กบ หมู ปลาดุก หรือหอยทาก พริกแกงผสานรสชาติจากทั้งกระเทียม หอมแดง ตะไคร้ และพริก แล้วเสริมกลิ่นอันเป็นเอกลักษณ์ด้วยผักชีลาวและใบแมงลัก บางสูตรจะระบุไว้ชัดเจนว่าเนื้อชนิดไหนใช้คู่กับผักอะไร', 'price' => 40, 'image' => '/Images/Aom.jpg'],
        ['id' => 3, 'name' => 'ไส้กรอกอีสาน', 'description' => 'ไส้กรอกอีสานมาจากการนำเนื้อ มัน และหนังหมูมาบด จากนั้นใส่ข้าวสวยเพื่อให้เกิดกระบวนการหมัก ทิ้งไว้ระยะสั้น ๆ แค่ 2-3 วันพอให้มีรสเปรี้ยวเล็ก ๆ ระหว่างทำยังปรุงรสด้วยกระเทียม เกลือ และพริกไทย เหมาะกินเป็นของว่างแสนอร่อย คู่กับพริก ขิง และกะหล่ำปลี', 'price' => 25, 'image' => '/images/E3 Sausage.jpg'],
        ['id' => 4, 'name' => 'แจ่ว', 'description' => 'แจ่วมีหลายสูตร แต่สูตรที่เราแนะนำวันนี้คือแจ่วมะเขือปลาร้า จับคู่กินกับผักนึ่ง ปลา หรือข้าวเหนียวเปล่า วัตถุดิบสำคัญคือปลาร้า พริกชี้ฟ้า พริกขี้หนู และพริกกะเหลี่ยงคั่ว กระเทียม หอมแดง มะเขือเทศย่าง และเพิ่มรสเปรี้ยวด้วยมะนาว', 'price' => 40, 'image' => '/images/Jaew.jpg'],
        ['id' => 5, 'name' => 'ข้าวจี่', 'description' => 'ข้าวจี่ตำรับอีสานคือข้าวเหนียวอัดเป็นแผ่นกลมหรือก้อนรี ชุบไข่ผสมเกลือแล้วนำไปย่าง เป็นภูมิปัญญาการถนอมข้าวเหนียวไม่ให้เสียเพราะอากาศแสนร้อน', 'price' => 10, 'image' => '/images/KoawJee.jpg'],
        ['id' => 6, 'name' => 'ก้อย', 'description' => 'ถ้าเปรียบเมนูนี้กับวัฒนธรรมอาหารฝั่งตะวันตก เราคงเรียกเมนูนี้ว่า ทาร์ทาร์ (tartare) ในแบบฉบับอีสาน ก้อยคือเนื้อดิบสับหรือหั่นเป็นชิ้นเล็ก ๆ แล้วนำไปคลุกเคล้ากับเครื่องเทศและผัก เนื้อที่ใช้ทำมีทั้งวัว ควาย กวาง ปลา กุ้ง หรือแม้แต่ไข่มดแดง ส่วนผสมอื่น ๆ จะเหมือนกับลาบ และแน่นอนว่าต้องกินคู่กับข้าวเหนียวร้อน ๆ เพื่อให้ซึมซับประสบการณ์อาหารอีสานอย่างเต็มที่', 'price' => 50, 'image' => '/images/Koey.jpg'],
        ['id' => 7, 'name' => 'ลาบ', 'description' => 'อาหารอีสานขึ้นชื่ออีกจาน ทำจากเนื้อสัตว์บดคลุกกับข้าวคั่ว หอมแดง ต้นหอม ใบสะระแหน่ เสริมรสด้วยพริก น้ำมะนาว และน้ำปลาหรือปลาร้า เนื้อที่ใช้โดยมากจะเป็นหมู วัว ไก่ หรือเป็ด แต่บางพื้นที่ก็ใช้เนื้อสัตว์ที่หาได้ในท้องถิ่นอีกด้วย นอกจากนี้ ยังมีเมนูลาบเลือดที่ผสมเลือดวัวหรือหมูสด เช่นเดียวกับอาหารอีสานอื่น ๆ นอกจากนั้นคนไทยยังชอบรับประทานลาบคู่กับข้าวเหนียวนึ่ง ในปัจจุบันบางร้านยังมีเมนูลาบทอดที่นำวัตถุดิบลาบมาปั้นเป็นก้อนกลมแล้วนำไปทอดกรอบ เกิดเป็นลาบทอดแสนอร่อยด้วย', 'price' => 70, 'image' => '/images/Lhab.jpg'],
        ['id' => 8, 'name' => 'หมก', 'description' => '“หมก” คือวิธีการรังสรรค์อาหารแบบหนึ่ง ใกล้เคียงกับห่อหมกของภาคกลาง เนื้อสัตว์หรือผักผสมกับเครื่องแกง ห่อใบตอง แล้วนำไปนึ่งหรือย่าง แต่หมกแบบอีสานจะไม่ใส่กะทิ แล้วเพิ่มความหอมด้วยสมุนไพรอย่างใบแมงลักแทน วัตถุดิบทำหมกมีหลากหลาย ตั้งแต่ปลา กบ ไข่มด ไข่ปลา หรือจะเป็นผักอย่างหน่อไม้ ปลีกล้วย หรือเห็ด', 'price' => 30, 'image' => '/images/Mok.jpg'],
        ['id' => 9, 'name' => 'แกงหน่อไม้', 'description' => 'แกงอีสานแสนอร่อยนี้ เหมาะสำหรับคนที่กำลังลดน้ำหนัก เพราะเป็นแกงที่ไม่ใส่กะทิ อันดับแรก นำหน่อไม้สดมาต้มเพื่อกำจัดรสขม ก่อนนำไปต้มรวมกับพริกแกงสีเขียวจากใบย่านาง แล้วเสริมความข้นด้วยข้าวเบือที่โขลกไว้ ใส่เครื่องแกงอื่น ๆ ที่เตรียมไว้ทั้งพริกขี้หนูและหอมแดง และปลาร้าเพื่อเพิ่มรส นอกจากนี้ยังสามารถใส่ผักตามฤดูกาลเพิ่มรสชาติได้อีกด้วย', 'price' => 45, 'image' => '/images/NohMai.jpg'],
        ['id' => 10, 'name' => 'ปลาส้ม', 'description' => '“ส้ม” ภาษาอีสานแปลว่าเปรี้ยว ดังนั้น เตรียมลิ้นรับรสเปรี้ยวที่เกิดจากการหมักได้ ปลาที่นำมาทำส่วนมากเป็นปลาน้ำจืดอย่างปลาตะเพียน อาจจะใช้ทั้งตัวหรือเฉพาะเนื้อ นำมาหมักกับข้าวสุกปรุงรสแล้วทิ้งไว้ 2-3 วัน ได้ที่แล้วนำไปทอดหรือย่างตามใจชอบ', 'price' => 25, 'image' => '/images/Spicy Fish.jpg'],
    ];
    // จำเป็นต้องใส้ก่อนมะงั้นแดดง
    public function index()
    {
        return Inertia::render('Products/Index', ['products' => $this->products]);  //use Inertia\Inertia; จำเป็น
    }

    /**
     * Show the form for creating a new resource.
     */
    public function create()
    {
        //
    }

    /**
     * Store a newly created resource in storage.
     */
    public function store(Request $request)
    {
        //
    }

    /**
     * Display the specified resource.
     */
    public function show(string $id)
    {
        $product = collect($this->products)->firstWhere('id', $id);

        if (!$product) {
            abort(404, 'Product not found');
        }

        return Inertia::render('Products/Show', ['product' => $product]);
    }

    /**
     * Show the form for editing the specified resource.
     */
    public function edit(string $id)
    {
        //
    }

    /**
     * Update the specified resource in storage.
     */
    public function update(Request $request, string $id)
    {
        //
    }

    /**
     * Remove the specified resource from storage.
     */
    public function destroy(string $id)
    {
        //
    }
}
